In [ ]:
###eda 탐색적 데이터 분석

In [1]:
import pandas as pd
import numpy as np

In [6]:
sales=pd.read_csv('sales.csv')

In [7]:
sales

               date  shop_id  item_id  item_price  item_cnt_day
0        02.01.2013       59    22154      999.00           1.0
1        03.01.2013       25     2552      899.00           1.0
2        05.01.2013       25     2552      899.00          -1.0
3        06.01.2013       25     2554     1709.05           1.0
4        15.01.2013       25     2555     1099.00           1.0
...             ...      ...      ...         ...           ...
2935844  10.10.2015       25     7409      299.00           1.0
2935845  09.10.2015       25     7460      299.00           1.0
2935846  14.10.2015       25     7459      349.00           1.0
2935847  22.10.2015       25     7440      299.00           1.0
2935848  03.10.2015       25     7460      299.00           1.0

[2935849 rows x 5 columns]

In [9]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2935849 entries, 0 to 2935848
Data columns (total 5 columns):
 #   Column        Dtype
---  ------        -----
 0   date          object
 1   shop_id       int64
 2   item_id       int64
 3   item_price    float64
 4   item_cnt_day  float64
dtypes: float64(2), int64(2), object(1)
memory usage: 112.0+ MB

In [10]:
sales.columns

Index(['date', 'shop_id', 'item_id', 'item_price', 'item_cnt_day'], dtype='object')

In [11]:
sales.describe

<bound method NDFrame.describe of                date  shop_id  item_id  item_price  item_cnt_day
0        02.01.2013       59    22154      999.00           1.0
1        03.01.2013       25     2552      899.00           1.0
2        05.01.2013       25     2552      899.00          -1.0
3        06.01.2013       25     2554     1709.05           1.0
4        15.01.2013       25     2555     1099.00           1.0
...             ...      ...      ...         ...           ...
2935844  10.10.2015       25     7409      299.00           1.0
2935845  09.10.2015       25     7460      299.00           1.0
2935846  14.10.2015       25     7459      349.00           1.0
2935847  22.10.2015       25     7440      299.00           1.0
2935848  03.10.2015       25     7460      299.00           1.0

[2935849 rows x 5 columns]>

In [13]:
sales.isnull().sum()

date            0
shop_id         0
item_id         0
item_price      0
item_cnt_day    0
dtype: int64

In [19]:
sales['item_price'].median()

399.0

In [20]:
sales['item_price'].mean()

890.8532326979881

In [39]:
sales['item_price'].value_counts()

299.000000     291352
399.000000     242603
149.000000     218432
199.000000     184044
349.000000     101461
                ...
1408.146667         1
505.673333          1
305.378824          1
499.220000          1
4040.000000         1
Name: item_price, Length: 19993, dtype: int64

In [38]:
sales['shop_id'].value_counts()

31    235636
25    186104
54    143480
28    142234
57    117428
42    109253
27    105366
6      82663
58     71441
56     69573
46     66321
50     65173
19     63911
15     59511
35     58445
21     58133
7      58076
47     56695
26     53910
18     53227
24     53032
53     52921
16     52734
30     50860
29     49225
38     46013
22     45434
51     44433
52     43502
59     42108
41     41967
37     39638
44     39530
43     39282
4      38242
5      38179
14     36979
45     35891
55     34769
12     34694
2      25991
3      25532
17     22950
48     21612
10     21397
13     17824
49     15849
39     13440
0       9857
32      7947
23      6963
34      5752
1       5678
33      5027
40      4257
9       3751
8       3412
20      1792
11       499
36       306
Name: shop_id, dtype: int64

In [24]:
sales['date'].value_counts()

28.12.2013    9434
29.12.2013    9335
30.12.2014    9324
30.12.2013    9138
31.12.2014    8347
              ...
14.05.2015    1174
28.04.2015    1154
06.10.2015    1152
13.05.2015    1128
12.05.2015    1123
Name: date, Length: 1034, dtype: int64

In [49]:
sales.sort_values('date')

               date  shop_id  item_id  item_price  item_cnt_day
16164    01.01.2013       28    11613      1499.0           1.0
101474   01.01.2013       51    10283       667.0           1.0
10197    01.01.2013       19     2828       499.0           1.0
101457   01.01.2013       51    10390       150.0           1.0
101455   01.01.2013       51    10591       110.0           1.0
...             ...      ...      ...         ...           ...
2263531  31.12.2014       10    15784       195.0           1.0
2238358  31.12.2014       31    18624       499.0           1.0
2238360  31.12.2014       31    18622       169.0           1.0
2210313  31.12.2014       59     9412       299.0           1.0
2239634  31.12.2014       34    15336       529.0           1.0

[2935849 rows x 5 columns]

In [46]:
sales['item_cnt_day'].sort_values()

1057907     -22.0
1835454     -16.0
2048519      -9.0
59156        -6.0
940092       -6.0
            ...
2608040     624.0
2851091     637.0
2864235     669.0
2326930    1000.0
2909818    2169.0
Name: item_cnt_day, Length: 2935849, dtype: float64

In [45]:
sales['item_cnt_day'].value_counts()

1.0       2629372
2.0        194201
3.0         47350
4.0         19685
5.0         10474
           ...
251.0           1
501.0           1
112.0           1
164.0           1
2169.0          1
Name: item_cnt_day, Length: 198, dtype: int64

In [28]:
sales.groupby('item_price')['item_cnt_day'].median()

item_price
-1.0000         1.0
 0.0700         1.0
 0.0875         4.0
 0.0900         1.0
 0.1000         1.0
               ...
 42990.0000     1.0
 49782.0000     1.0
 50999.0000     1.0
 59200.0000     1.0
 307980.0000    1.0
Name: item_cnt_day, Length: 19993, dtype: float64

In [44]:
sales.groupby('date')['item_cnt_day'].median()

date
01.01.2013    1.0
01.01.2014    1.0
01.01.2015    1.0
01.02.2013    1.0
01.02.2014    1.0
             ...
31.10.2013    1.0
31.10.2014    1.0
31.10.2015    1.0
31.12.2013    1.0
31.12.2014    1.0
Name: item_cnt_day, Length: 1034, dtype: float64

In [48]:
sales['item_cnt_day'].value_counts().index

Float64Index([   1.0,    2.0,    3.0,    4.0,    5.0,   -1.0,    6.0,    7.0,
                 8.0,    9.0,
              ...
               195.0,  131.0,  240.0,   93.0,  -16.0,  251.0,  501.0,  112.0,
               164.0, 2169.0],
             dtype='float64', length=198)

In [51]:
sales['item_price'].describe()

count    2.935849e+06
mean     8.908532e+02
std      1.729800e+03
min     -1.000000e+00
25%      2.490000e+02
50%      3.990000e+02
75%      9.990000e+02
max      3.079800e+05
Name: item_price, dtype: float64

In [53]:
sales[sales['item_price']<0]

              date  shop_id  item_id  item_price  item_cnt_day
484683  15.05.2013       32     2973        -1.0           1.0

In [55]:
sales[sales['item_price']==sales['item_price'].max()]

               date  shop_id  item_id  item_price  item_cnt_day
1163158  13.12.2013       12     6066    307980.0           1.0

In [56]:
sales[sales['item_id']==6066]

               date  shop_id  item_id  item_price  item_cnt_day
1163158  13.12.2013       12     6066    307980.0           1.0

In [59]:
sales.columns

Index(['date', 'shop_id', 'item_id', 'item_price', 'item_cnt_day'], dtype='object')

In [62]:
sales['shop_id'].value_counts()

31    235636
25    186104
54    143480
28    142234
57    117428
42    109253
27    105366
6      82663
58     71441
56     69573
46     66321
50     65173
19     63911
15     59511
35     58445
21     58133
7      58076
47     56695
26     53910
18     53227
24     53032
53     52921
16     52734
30     50860
29     49225
38     46013
22     45434
51     44433
52     43502
59     42108
41     41967
37     39638
44     39530
43     39282
4      38242
5      38179
14     36979
45     35891
55     34769
12     34694
2      25991
3      25532
17     22950
48     21612
10     21397
13     17824
49     15849
39     13440
0       9857
32      7947
23      6963
34      5752
1       5678
33      5027
40      4257
9       3751
8       3412
20      1792
11       499
36       306
Name: shop_id, dtype: int64

In [63]:
sales['item_cnt_day'].min()

-22.0

In [64]:
sales[sales['item_cnt_day']<=0]

               date  shop_id  item_id  item_price  item_cnt_day
2        05.01.2013       25     2552       899.0          -1.0
148      23.01.2013       25     2321       999.0          -1.0
175      07.01.2013       25     2199      1449.0          -1.0
807      02.01.2013       25     2330       599.0          -1.0
1041     13.01.2013       25     5034      1989.0          -1.0
...             ...      ...      ...         ...           ...
2934243  26.10.2015       25     3917       449.0          -1.0
2934462  18.10.2015       25     4896      6398.0          -1.0
2935263  05.10.2015       25    10039       249.0          -1.0
2935643  16.10.2015       25     7893      2990.0          -1.0
2935779  07.10.2015       25     7087       999.0          -1.0

[7356 rows x 5 columns]